GopalSaraf/Practicals/PSDL/include/proc/pic18lf24k40.h
// Register: MDCON1
#define MDCON1 MDCON1
extern volatile unsigned char           MDCON1              __at(0xF52);
#ifndef _LIB_BUILD
asm("MDCON1 equ 0F52h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CLSYNC                 :1;
        unsigned CLPOL                  :1;
        unsigned                        :2;
        unsigned CHSYNC                 :1;
        unsigned CHPOL                  :1;
    };
    struct {
        unsigned MDCLSYNC               :1;
        unsigned MDCLPOL                :1;
        unsigned                        :2;
        unsigned MDCHSYNC               :1;
        unsigned MDCHPOL                :1;
    };
} MDCON1bits_t;
extern volatile MDCON1bits_t MDCON1bits __at(0xF52);
// bitfield macros
#define _MDCON1_CLSYNC_POSN                                 0x0
#define _MDCON1_CLSYNC_POSITION                             0x0
#define _MDCON1_CLSYNC_SIZE                                 0x1
#define _MDCON1_CLSYNC_LENGTH                               0x1
#define _MDCON1_CLSYNC_MASK                                 0x1
#define _MDCON1_CLPOL_POSN                                  0x1
#define _MDCON1_CLPOL_POSITION                              0x1
#define _MDCON1_CLPOL_SIZE                                  0x1
#define _MDCON1_CLPOL_LENGTH                                0x1
#define _MDCON1_CLPOL_MASK                                  0x2
#define _MDCON1_CHSYNC_POSN                                 0x4
#define _MDCON1_CHSYNC_POSITION                             0x4
#define _MDCON1_CHSYNC_SIZE                                 0x1
#define _MDCON1_CHSYNC_LENGTH                               0x1
#define _MDCON1_CHSYNC_MASK                                 0x10
#define _MDCON1_CHPOL_POSN                                  0x5
#define _MDCON1_CHPOL_POSITION                              0x5
#define _MDCON1_CHPOL_SIZE                                  0x1
#define _MDCON1_CHPOL_LENGTH                                0x1
#define _MDCON1_CHPOL_MASK                                  0x20
#define _MDCON1_MDCLSYNC_POSN                               0x0
#define _MDCON1_MDCLSYNC_POSITION                           0x0
#define _MDCON1_MDCLSYNC_SIZE                               0x1
#define _MDCON1_MDCLSYNC_LENGTH                             0x1
#define _MDCON1_MDCLSYNC_MASK                               0x1
#define _MDCON1_MDCLPOL_POSN                                0x1
#define _MDCON1_MDCLPOL_POSITION                            0x1
#define _MDCON1_MDCLPOL_SIZE                                0x1
#define _MDCON1_MDCLPOL_LENGTH                              0x1
#define _MDCON1_MDCLPOL_MASK                                0x2
#define _MDCON1_MDCHSYNC_POSN                               0x4
#define _MDCON1_MDCHSYNC_POSITION                           0x4
#define _MDCON1_MDCHSYNC_SIZE                               0x1
#define _MDCON1_MDCHSYNC_LENGTH                             0x1
#define _MDCON1_MDCHSYNC_MASK                               0x10
#define _MDCON1_MDCHPOL_POSN                                0x5
#define _MDCON1_MDCHPOL_POSITION                            0x5
#define _MDCON1_MDCHPOL_SIZE                                0x1
#define _MDCON1_MDCHPOL_LENGTH                              0x1
#define _MDCON1_MDCHPOL_MASK                                0x20

// Register: MDSRC
#define MDSRC MDSRC
extern volatile unsigned char           MDSRC               __at(0xF53);
#ifndef _LIB_BUILD
asm("MDSRC equ 0F53h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SRCS0                  :1;
        unsigned SRCS1                  :1;
        unsigned SRCS2                  :1;
        unsigned SRCS3                  :1;
    };
    struct {
        unsigned SRCS                   :4;
    };
    struct {
        unsigned MDSRCS                 :4;
    };
    struct {
        unsigned MDSRCS0                :1;
        unsigned MDSRCS1                :1;
        unsigned MDSRCS2                :1;
        unsigned MDSRCS3                :1;
    };
} MDSRCbits_t;
extern volatile MDSRCbits_t MDSRCbits __at(0xF53);
// bitfield macros
#define _MDSRC_SRCS0_POSN                                   0x0
#define _MDSRC_SRCS0_POSITION                               0x0
#define _MDSRC_SRCS0_SIZE                                   0x1
#define _MDSRC_SRCS0_LENGTH                                 0x1
#define _MDSRC_SRCS0_MASK                                   0x1
#define _MDSRC_SRCS1_POSN                                   0x1
#define _MDSRC_SRCS1_POSITION                               0x1
#define _MDSRC_SRCS1_SIZE                                   0x1
#define _MDSRC_SRCS1_LENGTH                                 0x1
#define _MDSRC_SRCS1_MASK                                   0x2
#define _MDSRC_SRCS2_POSN                                   0x2
#define _MDSRC_SRCS2_POSITION                               0x2
#define _MDSRC_SRCS2_SIZE                                   0x1
#define _MDSRC_SRCS2_LENGTH                                 0x1
#define _MDSRC_SRCS2_MASK                                   0x4
#define _MDSRC_SRCS3_POSN                                   0x3
#define _MDSRC_SRCS3_POSITION                               0x3
#define _MDSRC_SRCS3_SIZE                                   0x1
#define _MDSRC_SRCS3_LENGTH                                 0x1
#define _MDSRC_SRCS3_MASK                                   0x8
#define _MDSRC_SRCS_POSN                                    0x0
#define _MDSRC_SRCS_POSITION                                0x0
#define _MDSRC_SRCS_SIZE                                    0x4
#define _MDSRC_SRCS_LENGTH                                  0x4
#define _MDSRC_SRCS_MASK                                    0xF
#define _MDSRC_MDSRCS_POSN                                  0x0
#define _MDSRC_MDSRCS_POSITION                              0x0
#define _MDSRC_MDSRCS_SIZE                                  0x4
#define _MDSRC_MDSRCS_LENGTH                                0x4
#define _MDSRC_MDSRCS_MASK                                  0xF
#define _MDSRC_MDSRCS0_POSN                                 0x0
#define _MDSRC_MDSRCS0_POSITION                             0x0
#define _MDSRC_MDSRCS0_SIZE                                 0x1
#define _MDSRC_MDSRCS0_LENGTH                               0x1
#define _MDSRC_MDSRCS0_MASK                                 0x1
#define _MDSRC_MDSRCS1_POSN                                 0x1
#define _MDSRC_MDSRCS1_POSITION                             0x1
#define _MDSRC_MDSRCS1_SIZE                                 0x1
#define _MDSRC_MDSRCS1_LENGTH                               0x1
#define _MDSRC_MDSRCS1_MASK                                 0x2
#define _MDSRC_MDSRCS2_POSN                                 0x2
#define _MDSRC_MDSRCS2_POSITION                             0x2
#define _MDSRC_MDSRCS2_SIZE                                 0x1
#define _MDSRC_MDSRCS2_LENGTH                               0x1
#define _MDSRC_MDSRCS2_MASK                                 0x4
#define _MDSRC_MDSRCS3_POSN                                 0x3
#define _MDSRC_MDSRCS3_POSITION                             0x3
#define _MDSRC_MDSRCS3_SIZE                                 0x1
#define _MDSRC_MDSRCS3_LENGTH                               0x1
#define _MDSRC_MDSRCS3_MASK                                 0x8

// Register: MDCARL
#define MDCARL MDCARL
extern volatile unsigned char           MDCARL              __at(0xF54);
#ifndef _LIB_BUILD
asm("MDCARL equ 0F54h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CLS                    :3;
    };
    struct {
        unsigned MDCLS                  :3;
    };
    struct {
        unsigned MDCLS0                 :1;
        unsigned MDCLS1                 :1;
        unsigned MDCLS2                 :1;
    };
    struct {
        unsigned CLS0                   :1;
        unsigned CLS1                   :1;
        unsigned CLS2                   :1;
    };
} MDCARLbits_t;
extern volatile MDCARLbits_t MDCARLbits __at(0xF54);
// bitfield macros
#define _MDCARL_CLS_POSN                                    0x0
#define _MDCARL_CLS_POSITION                                0x0
#define _MDCARL_CLS_SIZE                                    0x3
#define _MDCARL_CLS_LENGTH                                  0x3
#define _MDCARL_CLS_MASK                                    0x7
#define _MDCARL_MDCLS_POSN                                  0x0
#define _MDCARL_MDCLS_POSITION                              0x0
#define _MDCARL_MDCLS_SIZE                                  0x3
#define _MDCARL_MDCLS_LENGTH                                0x3
#define _MDCARL_MDCLS_MASK                                  0x7
#define _MDCARL_MDCLS0_POSN                                 0x0
#define _MDCARL_MDCLS0_POSITION                             0x0
#define _MDCARL_MDCLS0_SIZE                                 0x1
#define _MDCARL_MDCLS0_LENGTH                               0x1
#define _MDCARL_MDCLS0_MASK                                 0x1
#define _MDCARL_MDCLS1_POSN                                 0x1
#define _MDCARL_MDCLS1_POSITION                             0x1
#define _MDCARL_MDCLS1_SIZE                                 0x1
#define _MDCARL_MDCLS1_LENGTH                               0x1
#define _MDCARL_MDCLS1_MASK                                 0x2
#define _MDCARL_MDCLS2_POSN                                 0x2
#define _MDCARL_MDCLS2_POSITION                             0x2
#define _MDCARL_MDCLS2_SIZE                                 0x1
#define _MDCARL_MDCLS2_LENGTH                               0x1
#define _MDCARL_MDCLS2_MASK                                 0x4
#define _MDCARL_CLS0_POSN                                   0x0
#define _MDCARL_CLS0_POSITION                               0x0
#define _MDCARL_CLS0_SIZE                                   0x1
#define _MDCARL_CLS0_LENGTH                                 0x1
#define _MDCARL_CLS0_MASK                                   0x1
#define _MDCARL_CLS1_POSN                                   0x1
#define _MDCARL_CLS1_POSITION                               0x1
#define _MDCARL_CLS1_SIZE                                   0x1
#define _MDCARL_CLS1_LENGTH                                 0x1
#define _MDCARL_CLS1_MASK                                   0x2
#define _MDCARL_CLS2_POSN                                   0x2
#define _MDCARL_CLS2_POSITION                               0x2
#define _MDCARL_CLS2_SIZE                                   0x1
#define _MDCARL_CLS2_LENGTH                                 0x1
#define _MDCARL_CLS2_MASK                                   0x4

// Register: MDCARH
#define MDCARH MDCARH
extern volatile unsigned char           MDCARH              __at(0xF55);
#ifndef _LIB_BUILD
asm("MDCARH equ 0F55h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CHS                    :3;
    };
    struct {
        unsigned CHS0                   :1;
        unsigned CHS1                   :1;
        unsigned CHS2                   :1;
    };
    struct {
        unsigned MDCHS                  :3;
    };
    struct {
        unsigned MDCHS0                 :1;
        unsigned MDCHS1                 :1;
        unsigned MDCHS2                 :1;
    };
} MDCARHbits_t;
extern volatile MDCARHbits_t MDCARHbits __at(0xF55);
// bitfield macros
#define _MDCARH_CHS_POSN                                    0x0
#define _MDCARH_CHS_POSITION                                0x0
#define _MDCARH_CHS_SIZE                                    0x3
#define _MDCARH_CHS_LENGTH                                  0x3
#define _MDCARH_CHS_MASK                                    0x7
#define _MDCARH_CHS0_POSN                                   0x0
#define _MDCARH_CHS0_POSITION                               0x0
#define _MDCARH_CHS0_SIZE                                   0x1
#define _MDCARH_CHS0_LENGTH                                 0x1
#define _MDCARH_CHS0_MASK                                   0x1
#define _MDCARH_CHS1_POSN                                   0x1
#define _MDCARH_CHS1_POSITION                               0x1
#define _MDCARH_CHS1_SIZE                                   0x1
#define _MDCARH_CHS1_LENGTH                                 0x1
#define _MDCARH_CHS1_MASK                                   0x2
#define _MDCARH_CHS2_POSN                                   0x2
#define _MDCARH_CHS2_POSITION                               0x2
#define _MDCARH_CHS2_SIZE                                   0x1
#define _MDCARH_CHS2_LENGTH                                 0x1
#define _MDCARH_CHS2_MASK                                   0x4
#define _MDCARH_MDCHS_POSN                                  0x0
#define _MDCARH_MDCHS_POSITION                              0x0
#define _MDCARH_MDCHS_SIZE                                  0x3
#define _MDCARH_MDCHS_LENGTH                                0x3
#define _MDCARH_MDCHS_MASK                                  0x7
#define _MDCARH_MDCHS0_POSN                                 0x0
#define _MDCARH_MDCHS0_POSITION                             0x0
#define _MDCARH_MDCHS0_SIZE                                 0x1
#define _MDCARH_MDCHS0_LENGTH                               0x1
#define _MDCARH_MDCHS0_MASK                                 0x1
#define _MDCARH_MDCHS1_POSN                                 0x1
#define _MDCARH_MDCHS1_POSITION                             0x1
#define _MDCARH_MDCHS1_SIZE                                 0x1
#define _MDCARH_MDCHS1_LENGTH                               0x1
#define _MDCARH_MDCHS1_MASK                                 0x2
#define _MDCARH_MDCHS2_POSN                                 0x2
#define _MDCARH_MDCHS2_POSITION                             0x2
#define _MDCARH_MDCHS2_SIZE                                 0x1
#define _MDCARH_MDCHS2_LENGTH                               0x1
#define _MDCARH_MDCHS2_MASK                                 0x4

